src_ext/InformationRegisters/УЗ_ЖурналРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЖурналРассылки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_КаналыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_КаналыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WhatsApp</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеАбонемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_СтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_СтатусыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Песочница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/CommonForms/УЗ_НастройкиСообщений/Ext/Form/Module.bsl
//Каналы сообщений и напоминания (руководитель): Telegram, SMS, WhatsApp — провайдер, аккаунт, ключ; шаблоны
//напоминаний о занятии, об окончании абонемента и о задолженности. Почта настраивается отдельно (администратор,
//«Настройки почты»). Ключи в форму не передаются: поле пустое, сохранённый ключ меняется, только если в поле что-то
//ввели (как пароль почты). Безопасный режим — строка «Состояние» говорит, как его снять.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не УЗ_Сообщения.ЕстьПравоНастройки() Тогда
		ВызватьИсключение НСтр("ru = 'Каналы сообщений может настраивать только руководитель.'");
	КонецЕсли;
	Для Каждого Канал Из КаналыФормы() Цикл
		Префикс = ПрефиксКанала(Канал);
		Настройки = УЗ_Сообщения.НастройкиКанала(Канал);
		ЭтотОбъект[Префикс + "Включен"] = Настройки.Включен;
		ЭтотОбъект[Префикс + "Провайдер"] = Настройки.Провайдер;
		ЭтотОбъект[Префикс + "Логин"] = Настройки.Логин;
		ЭтотОбъект[Префикс + "АдресСервиса"] = Настройки.АдресСервиса;
		ЭтотОбъект[Префикс + "Отправитель"] = Настройки.Отправитель;
		ЭтотОбъект[Префикс + "КлючЗадан"] = Настройки.КлючЗадан;
		ЭтотОбъект[Префикс + "Ключ"] = "";
		Если Канал = Перечисления.УЗ_КаналыСообщений.Телеграм Тогда
			ТелеграмИмяБота = Настройки.ИмяБота;
		КонецЕсли;
		Поле = Элементы[Префикс + "Провайдер"];
		Поле.СписокВыбора.Очистить();
		Для Каждого Провайдер Из УЗ_ПровайдерыСообщений.ПровайдерыКанала(Канал) Цикл
			Поле.СписокВыбора.Добавить(Провайдер);
		КонецЦикла;
		Если Не ЗначениеЗаполнено(ЭтотОбъект[Префикс + "Провайдер"]) И Поле.СписокВыбора.Количество() > 0 Тогда
			ЭтотОбъект[Префикс + "Провайдер"] = Поле.СписокВыбора[0].Значение;
		КонецЕсли;
		ОбновитьПодсказкуКлюча(Префикс);
	КонецЦикла;
	Для Каждого Вид Из ВидыФормы() Цикл
		Префикс = ПрефиксВида(Вид);
		Шаблон = УЗ_Сообщения.Шаблон(Вид);
		ЭтотОбъект[Префикс + "Включено"] = Шаблон.Включено;
		ЭтотОбъект[Префикс + "Тема"] = Шаблон.Тема;
		ЭтотОбъект[Префикс + "Текст"] = Шаблон.Текст;
		ЭтотОбъект[Префикс + "КраткийТекст"] = Шаблон.КраткийТекст;
		ЭтотОбъект[Префикс + "Подстановки"] = НСтр("ru = 'Подстановки:'") + " " + УЗ_Сообщения.Подстановки(Вид);
		Если Вид = Перечисления.УЗ_ВидыСообщений.Занятие Тогда
			ЗанятиеЗаЧасов = Шаблон.ЗаЧасов;
		ИначеЕсли Вид = Перечисления.УЗ_ВидыСообщений.ОкончаниеАбонемента Тогда
			АбонементОсталосьЗанятий = Шаблон.ОсталосьЗанятий;
			АбонементЗаДней = Шаблон.ЗаДней;
		КонецЕсли;
	КонецЦикла;
	КаналПроверки = Перечисления.УЗ_КаналыСообщений.Телеграм;
	ОбновитьСостояние();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаналПроверкиПриИзменении(Элемент)

	АдресПроверки = "";

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Если ЗаписатьНаСервере() Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)

	Если ЗаписатьНаСервере() Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Настройки сообщений сохранены'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКанал(Команда)

	Если Не ЗаписатьНаСервере() Тогда
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(АдресПроверки) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите, кому отправить проверочное сообщение.'"),
			"АдресПроверки");
		Возврат;
	КонецЕсли;
	ПроверитьКаналНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНапоминания(Команда)

	Если Не ЗаписатьНаСервере() Тогда
		Возврат;
	КонецЕсли;
	ОтправитьНапоминанияНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)

	ОткрытьФорму("РегистрСведений.УЗ_ЖурналРассылки.ФормаСписка", , ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция КаналыФормы()

	Итог = Новый Массив;
	Итог.Добавить(Перечисления.УЗ_КаналыСообщений.Телеграм);
	Итог.Добавить(Перечисления.УЗ_КаналыСообщений.SMS);
	Итог.Добавить(Перечисления.УЗ_КаналыСообщений.WhatsApp);
	Возврат Итог;

КонецФункции

&НаСервереБезКонтекста
Функция ВидыФормы()

	Итог = Новый Массив;
	Итог.Добавить(Перечисления.УЗ_ВидыСообщений.Занятие);
	Итог.Добавить(Перечисления.УЗ_ВидыСообщений.ОкончаниеАбонемента);
	Итог.Добавить(Перечисления.УЗ_ВидыСообщений.Задолженность);
	Возврат Итог;

КонецФункции

//Имена реквизитов формы канала: ТелеграмВключен, SMSКлюч, WhatsAppЛогин…
&НаСервереБезКонтекста
Функция ПрефиксКанала(Канал)

	Если Канал = Перечисления.УЗ_КаналыСообщений.Телеграм Тогда
		Возврат "Телеграм";
	ИначеЕсли Канал = Перечисления.УЗ_КаналыСообщений.SMS Тогда
		Возврат "SMS";
	КонецЕсли;
	Возврат "WhatsApp";

КонецФункции

&НаСервереБезКонтекста
Функция ПрефиксВида(Вид)

	Если Вид = Перечисления.УЗ_ВидыСообщений.Занятие Тогда
		Возврат "Занятие";
	ИначеЕсли Вид = Перечисления.УЗ_ВидыСообщений.ОкончаниеАбонемента Тогда
		Возврат "Абонемент";
	КонецЕсли;
	Возврат "Долг";

КонецФункции

&НаСервере
Процедура ОбновитьПодсказкуКлюча(Префикс)

	Элементы[Префикс + "Ключ"].ПодсказкаВвода = ?(ЭтотОбъект[Префикс + "КлючЗадан"],
		НСтр("ru = 'сохранён — введите, чтобы заменить'"), НСтр("ru = 'не задан'"));

КонецПроцедуры

//Строка «Состояние»: безопасный режим (как снять) или какие каналы готовы.
&НаСервере
Процедура ОбновитьСостояние()

	ДоступностьСети = УЗ_ПровайдерыСообщений.ДоступностьHTTP();
	Если ДоступностьСети.БезопасныйРежим Тогда
		Состояние = УЗ_Сообщения.ТекстБезопасногоРежима();
		Элементы.Состояние.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветМинусаДенег();
		Возврат;
	КонецЕсли;
	Готовы = Новый Массив;
	Для Каждого Канал Из УЗ_Сообщения.Каналы() Цикл
		Если ПустаяСтрока(УЗ_Сообщения.ПричинаНеготовностиКанала(Канал)) Тогда
			Готовы.Добавить(Строка(Канал));
		КонецЕсли;
	КонецЦикла;
	Состояние = ?(Готовы.Количество() = 0, НСтр("ru = 'Ни один канал не настроен: сообщения не отправляются.'"),
		НСтр("ru = 'Готовы к отправке:'") + " " + СтрСоединить(Готовы, ", ") + ".");
	Элементы.Состояние.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветПояснения();

КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()

	Для Каждого Канал Из КаналыФормы() Цикл
		Префикс = ПрефиксКанала(Канал);
		Если Не ЭтотОбъект[Префикс + "Включен"] Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЭтотОбъект[Префикс + "КлючЗадан"] И ПустаяСтрока(ЭтотОбъект[Префикс + "Ключ"]) Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Чтобы отправлять через «%1», укажите ключ доступа.'"),
				Канал), Префикс + "Ключ");
			Возврат Ложь;
		КонецЕсли;
		Если УЗ_ПровайдерыСообщений.НуженЛогин(ЭтотОбъект[Префикс + "Провайдер"])
			И ПустаяСтрока(ЭтотОбъект[Префикс + "Логин"]) Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Провайдеру «%1» нужен логин (номер аккаунта).'"),
				ЭтотОбъект[Префикс + "Провайдер"]), Префикс + "Логин");
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Канал Из КаналыФормы() Цикл
		Префикс = ПрефиксКанала(Канал);
		Данные = Новый Структура("Включен, Провайдер, АдресСервиса, Логин, Отправитель, ИмяБота",
			ЭтотОбъект[Префикс + "Включен"], ЭтотОбъект[Префикс + "Провайдер"],
				СокрЛП(ЭтотОбъект[Префикс + "АдресСервиса"]),
			СокрЛП(ЭтотОбъект[Префикс + "Логин"]), СокрЛП(ЭтотОбъект[Префикс + "Отправитель"]),
			?(Канал = Перечисления.УЗ_КаналыСообщений.Телеграм, СтрЗаменить(СокрЛП(ТелеграмИмяБота), "@", ""), ""));
		НовыйКлюч = ЭтотОбъект[Префикс + "Ключ"];
		ИзменитьКлюч = Не ПустаяСтрока(НовыйКлюч);
		УЗ_Сообщения.СохранитьНастройкиКанала(Канал, Данные, НовыйКлюч, ИзменитьКлюч);
		Если ИзменитьКлюч Тогда
			ЭтотОбъект[Префикс + "КлючЗадан"] = Истина;
			ЭтотОбъект[Префикс + "Ключ"] = "";
			ОбновитьПодсказкуКлюча(Префикс);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Вид Из ВидыФормы() Цикл
		Префикс = ПрефиксВида(Вид);
		Данные = Новый Структура("Включено, ЗаЧасов, ОсталосьЗанятий, ЗаДней, Тема, Текст, КраткийТекст",
			ЭтотОбъект[Префикс + "Включено"], ЗанятиеЗаЧасов, АбонементОсталосьЗанятий, АбонементЗаДней,
			ЭтотОбъект[Префикс + "Тема"], ЭтотОбъект[Префикс + "Текст"], ЭтотОбъект[Префикс + "КраткийТекст"]);
		УЗ_Сообщения.СохранитьШаблон(Вид, Данные);
	КонецЦикла;
	ОбновитьСостояние();
	Возврат Истина;

КонецФункции

&НаСервере
Процедура ПроверитьКаналНаСервере()

	Итог = УЗ_Сообщения.ПроверитьКанал(КаналПроверки, АдресПроверки);
	Если Итог.Отправлено Тогда
		Состояние = СтрШаблон(НСтр("ru = 'Проверочное сообщение отправлено (%1): %2%3.'"), КаналПроверки, АдресПроверки,
			?(Итог.Песочница, " — " + НСтр("ru = 'в песочнице проверок, наружу не ушло'"), ""));
		Элементы.Состояние.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветПояснения();
	Иначе
		Состояние = НСтр("ru = 'Не отправлено:'") + " " + Итог.ТекстОшибки;
		Элементы.Состояние.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветМинусаДенег();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтправитьНапоминанияНаСервере()

	ЦиклОтправки = УЗ_Сообщения.НовыйЦикл();
	Итоги = УЗ_Сообщения.НапоминанияОЗанятиях(Неопределено, ЦиклОтправки);
	Для Каждого Итог Из УЗ_Сообщения.НапоминанияОбАбонементах(Неопределено, ЦиклОтправки) Цикл
		Итоги.Добавить(Итог);
	КонецЦикла;
	Ошибок = 0;
	Для Каждого Итог Из Итоги Цикл
		Ошибок = Ошибок + ?(Итог.Статус = Перечисления.УЗ_СтатусыСообщений.Ошибка, 1, 0);
	КонецЦикла;
	Состояние = СтрШаблон(НСтр("ru = 'Напоминаний отправлено: %1, с ошибкой: %2. Подробности — в журнале сообщений.'"),
		Итоги.Количество() - Ошибок, Ошибок);

КонецПроцедуры

#КонецОбласти
